package com.feng.freader.entity.bean;

import java.util.List;

/**
 * @author Feng Zhaohao
 * Created on 2019/11/25
 */
public class DetailedChapterBean {

    /**
     * message : 成功!
     * num : 第一章 结束也是一种开始
     * content : ["readx();    萧炎的身影缓缓的悬浮在了这片大陆的上空，眯缝着眼睛看着眼前这爆起的光柱，平静了多年的眼眸顿时变得火热起来，口中喃喃道：\u201c这几十年的修养，几乎都快让我忘掉战斗的感觉了。。。。。。咦？\u201d萧炎感觉到什么，眼睛猛然一睁，死死的盯着眼前的光柱，眼神里充满了惊讶之色。","    而就在这光柱爆起之时，四方的强者也是纷纷赶来，只是在短短的瞬息之间，这片空间就汇聚了无数新一代的强者。","    那时萧炎在虚无吞炎上救出的药族二人，已经重新开始延续血脉；古族也诞生了不少新一代的强者，古力与古魅这二人便是古族的代表，小小年纪便达到了斗宗的实力；太虚古龙自然也不落后。如此势头，恐怕在将来，这片世界还会诞生更加精彩的传奇。","    古元和烛坤悬空靠近萧炎身旁，眼睛不住的看向光柱，低声问道：\u201c这\u2026\u2026难道就是通向另外大陆的通道？\u201d","    站在周边的强者闻言都纷纷回过头来，萧炎眉头微微一皱，随后点点头。","    此时站在离光柱千里之内的人，都感觉到了这光柱中有种奇异的能量在吸扯着他们体内的斗气。古元和烛坤脸色微微一变，急忙运起斗气护住身形，随即连连后退，眼中都充满了惊讶之色，仅有萧炎未动，仍旧如此近距离的仰身观看。","    \u201c这是\u2026\u2026帝之源气？\u201d萧炎猛的一怔，一种强烈的感觉从心中升起，手掌在光柱之中拼命的往外抓着，一把又一把，古元、烛坤乃至几大强者看着萧炎如此，知道这东西的重要，也都纷纷的收集着萧炎抓来的帝之源气，顿时间，斗气大陆上就有了些许帝之源气。有了这帝之源气，他们就将可能晋级斗帝。","    在如此距离之下古元烛坤受到了极强的威压，这威压就来自于这万丈光柱，这浓郁的帝之源气不是古元烛坤这些非斗帝强者可以承受得住的，就连萧炎体内的斗气也是微微颤抖。","    抓了不少帝之源气后，萧炎扭身而下，搂过薰儿纤细柳腰埋首肩头，轻轻的说道：\u201c别担心我，你好好照顾孩儿些。薰儿，等我回来。\u201d","    薰儿的娇躯轻微一抖，萧炎要走，而且，是去一个未知的世界，她怎么会舍得，又怎么会不担心。但是她知道，萧炎不仅是她的男人，还是这个大陆的最强者，永远追求着无上之境，只得极不情愿的轻轻说道：\u201c外面可不像斗气大陆，少逞能，多照顾自己。\u201d","    萧炎笑了笑，点点头，应了一声，这时耳边一道不好气的声音响起：\u201c哼，薰儿允许我可是没有允许。\u201d","    一道倩影出现于天际，青光一震便来到萧炎身旁，赫然便是彩鳞。","    萧炎先是一怔，随即对着彩鳞笑笑，自己对感情方面也不知道该如何表达是好，无奈只得向熏儿求助了，可怜的眼神看向薰儿。","    看着萧炎一副可怜的表情，薰儿忍不住扑哧一笑，可还没等薰儿说话彩鳞又不好气的说道：\u201c哼，别让薰儿来劝我，没用的，反正我可不能让你这么轻易的就走，这么大一家子和这么多的孩子让我和薰儿照顾，哼，你想得倒好！\u201d","    周围的一干人看着这对夫妻，只能干笑一声。萧炎也是无奈，薰儿急忙凑过去对着彩鳞笑道：\u201c彩鳞姐，萧炎哥哥毕竟是个大男人，喜欢闯荡，你就让他去吧，要不以后我带孩子就是了。\u201d","    彩鳞闻言，看了薰儿一眼，又看了看萧炎哀求的样子，无奈的摆摆手：\u201c好了好了，哼，你最好完好无缺的给我回来，若是少了一根头发，我就扒了你的皮，我可不要孩子没爹，要不然\u2026\u2026哼哼，看我怎么收拾你。\u201d","    萧炎表情有些木然，彩鳞这话怎么听着有些渗人呢？赶紧一拱手，笑谑道：\u201c多谢老婆，放心，我一定完好无缺的回来。\u201d旋即一挥手，在萧炎面前出现了数个光球，\u201c这是帝之源气，有了它，你们就能突破到斗帝了，等你们到突破之日再用吧。\u201d说着，挥手将几个光球分别射向彩鳞、薰儿、古元、烛坤等。","    \u201c各位前辈，我走之后，希望大家帮忙照顾一下萧族，萧炎在这里谢谢大家了。\u201d萧炎对着四周来送行的众强者拱手道，自己要离开，唯一担心的就是萧族了，可不能出现什么岔子。如今萧炎可是儿孙满堂啊，诺大个萧族，在萧炎晋级斗帝之后，由于血脉之力的激活，凡是萧炎至亲之人，通通都受到了血脉之力的好处，实力都如顺水推舟般轻而易举的得到提升，短短的几年时间，萧族就以惊人的发展速度，成为几大家族之首，当然，这少不了有萧炎这位炎帝坐镇。","    \u201c哈哈，放心吧，有老夫在，萧族会出现什么岔子？\u201d古元仰头笑道，看着远处的黑衣少年，心中也是不禁感叹，只是短短的数十年，一个无知的少年，恍然之间就成长为了这大陆之上的巅峰存在，真有些让人羡慕啊。","    \u201c还有我呢，放心吧萧炎，这里就交给我们了，我和古老头也会尽快突破斗帝的，随后便去找你。\u201d烛坤向前一步拍拍胸脯说道，如今有了帝之源气，他们晋级斗帝也仅仅是个时间问题罢了。","    \u201c哈哈，好，小子萧炎到时候一定来迎接。\u201d萧炎拱手谢道，对于萧族他这才放心了不少。","    \u201c爹爹！\u201d随着一声娇唤，一道倩影扑入萧炎的怀里，不是别人，正是萧潇。","    如今萧潇已经十一二岁了，长得和她母亲一样，天生的魅惑脸，恐怕一般的人还真受不住她。经过这些年的成长，萧潇的实力确实让老家伙们喷血，萧潇的体内有着母亲的九彩吞天莽的血脉，又加上萧炎的斗帝血脉，实力竟然爆发到了九星斗圣，以萧潇的成长速度，恐怕以后彩鳞的实力也是不及吧。","    萧炎娇惯的抚摸着萧潇的头，笑着说道：\u201c萧潇，爹爹去去就回，你要替爹爹看好萧族哦。\u201d萧炎抱开萧潇，捏捏萧潇的鼻子，萧潇立马严肃起来，像个大人般很认真的说道：\u201c是！没问题！爹爹放心吧。爹爹，你看师祖也来了。\u201d说完指了指萧炎身后。","    \u201c老师\u2014\u2014\u201d萧炎扭过头去，一道苍老的身影映入萧炎漆黑的眼眸中，萧炎顿时显得激动起来，自己一个乌坦城的无知少年，正是在这道苍老的身影的庇护之下才得以茁壮成长，如果没有他，萧炎可能一文不值，甚至早就魂飞魄散，哪里还能有今天的成就？","    药老欣慰地一笑，回想起那个还需要自己庇护的少年，如今已然成长为了斗气大陆的霸主，真是感慨万分啊。","    \u201c你自己多加小心吧，现在老师也帮不上你什么了，倒是等你出去闯出点名堂后，也让为师跟你一同去见识见识，哈哈。。。。。。\u201d药老哈哈笑道。","    萧炎笑了笑，老师还是和以前一样啊。萧炎一挥手，将几枚丹药和光团射向药老，缓缓道：\u201c弟子谨遵师傅教诲。老师，这是弟子孝敬您的，祝老师早日晋级斗帝。\u201d这是萧炎这些年来，专门为药老准备的九品金丹，还有刚刚获得的帝之源气。","    药老看着手中的物品，眼中闪过一抹波动。","    烛坤古元看着药老手中的几枚闪烁着金光的丹药，不免有些羡慕，这九品金丹，恐怕在斗气大陆之上无人能及吧，因为那始终是由斗帝强者出手炼制，不是一般的金丹所能比的。","    \u201c好了，你去吧，自己多小心些。\u201d药老点点头。","    \u201c老师对弟子之恩，萧炎没齿难忘，请受弟子一拜。\u201d萧炎顿时之间跪下，发出了动地的声响，似乎天地都为之动容。","    萧炎重重的磕了几个头，眼中是万分的感恩之色，回想着以前的点点滴滴，怎能让他不动情。","    萧炎缓缓的起身，不再多说，身影如一抹流星般的光芒划破天际，冲着通道之中暴掠而去，顿时消失在了天地之间，身后却传来了浩浩荡荡的恭送之声。","    \u201c恭送炎帝\u2014\u2014炎帝万岁\u2014\u2014\u201d","    在斗气大陆，萧炎是一个传奇，他的事迹也必将世世代代流传下去，流传千古。","    蓝色的光柱充满了狂暴的能量，即便如古元和烛坤这般斗圣巅峰的强者，距离光柱千里尚感受到光柱能量的强横，如果进去，恐怕立马就会被光柱中狂暴的能量瞬间压得粉碎。如今恐怕只有萧炎才有这等力量进入，而且就连萧炎也不清楚进去会发生什么，炎帝，斗气大陆的最强者尚且不敢大意，可见这光柱有多么的强横。","    萧炎脚踏虚空，身形直接跨入了光柱之中，随即光柱便消失在了这片大陆之上。","    作为一个曾经拯救过斗气大陆的人，萧炎在众强者心中已经占据了神圣的地位，所有的人都不禁为他担心，那毕竟是一片未知的空间，会发生什么谁也不知道。","    这斗气大陆之上，为什么没有一位斗帝留下，难道说，随着时间的流逝，远古斗帝也随着时间的腐蚀而陨落了？还是说，都如同萧炎一般，被带离了这片天地？这是个谜，无人知晓。","    ;"]
     * code : 0
     */
    private String message;
    private String num;
    private int code;
    private List<String> content;

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public String getNum() {
        return num;
    }

    public void setNum(String num) {
        this.num = num;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public List<String> getContent() {
        return content;
    }

    public void setContent(List<String> content) {
        this.content = content;
    }
}
